Repository: 84000/data-translation-memory
Catalog: toh47-v3.tmx
Source language: bo
Languages: en

source: སངས་རྒྱས་ཀྱི་ཆོ་འཕྲུལ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་དཔལ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་གཟི་བརྗིད་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་སྤྱོད་ལམ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་རྣམ་པར་རོལ་པ་ཆེན་པོས་ལྕང་ལོ་ཅན་གྱི་ཕོ་བྲང་འཁོར་ག་ལ་བ་དེར་ནམ་མཁའི་དཀྱིལ་གྱི་ལམ་ནས་ངང་པའི་རྒྱལ་པོ་བཞིན་དུ་ཐོགས་པ་མེད་པར་གཤེགས་པ་དང་།
en: By means of the great majestic power of the Buddha, the great superhuman power of the Buddha, the great transformative power of the Buddha, the great miraculous display of the Buddha, the great glory of the Buddha, the great vital energy of the Buddha, the great demeanor of the Buddha, and the great child’s play of the Buddha, they flew freely through the vault of the sky like the king of swans, toward the capital city of Aḍagavatī.

source: འདོད་པ་ན་སྤྱོད་པ་དང་། གཟུགས་ན་སྤྱོད་པའི་ལྷའི་བུ་དེ་དག་གིས་བཅོམ་ལྡན་འདས་ནམ་མཁའི་དཀྱིལ་གྱི་ལམ་ནས་ངང་པའི་རྒྱལ་པོ་ལྟར་ཐོགས་པ་ནི་མི་མངའ།
en: The gods of the realms of desire and form saw the Blessed One coming from afar.

source: ཉི་མའི་དཀྱིལ་འཁོར་འཆར་བ་ནི་འདྲ།
en: As he flew freely through the vault of the sky, he looked like the sphere of the rising sun.

source: ཟླ་བ་ཉ་བའི་དཀྱིལ་འཁོར་སྐར་མའི་ཚོགས་ཀྱིས་བསྐོར་བ་དང་ནི་མཚུངས།
en: He looked as if he were the full moon being encircled by a constellation of stars.

source: ལྷའི་རྒྱལ་པོ་བརྒྱ་བྱིན་ལྟར་ལྷའི་ཚོགས་ཀྱིས་ནི་བསྐོར།
en: He was surrounded by a host of gods as if he were Śakra, King of the Gods.

source: ཚངས་པ་ཆེན་པོ་ལྟར་ཚངས་པའི་འཁོར་གྱིས་ནི་བསྐོར་ཅིང་གཤེགས་པར་རྒྱང་རིང་པོ་ནས་མཐོང་ངོ་། །
en: He was surrounded by brahmās as if he were Great Brahmā.

source: མཐོང་ནས་ཀྱང་ཚིམ་ཞིང་མགུ་ལ་ཡི་རངས་ཏེ། རབ་ཏུ་དགའ་ནས་དགའ་བ་དང་། ཡིད་བདེ་བ་སྐྱེས་ཏེ། བཅོམ་ལྡན་འདས་ལ་མཆོད་པའི་ལས་ཀྱི་ཕྱིར་ལྷའི་མེ་ཏོག་ཨུད་པ་ལ་དང་། ཀུ་མུ་ད་དང་། པད་མ་དཀར་པོ་དང་། མན་ད་ར་བ་དང་། མན་དཱ་ར་བ་ཆེན་པོ་དང་། ཡོངས་འདུ་དང་། ཡོངས་འདུ་ཆེན་པོ་དང་། མན་ཛུ་ཤ་ཀ་དང་། མན་ཛུ་ཤ་ཀ་ཆེན་པོ་དང་། སྠ་ལ་དང་། སྠ་ལ་ཆེན་པོ་དང་། མདོག་མཛེས་དང་། མདོག་མཛེས་ཆེན་པོ་དང་། འཁོར་ལོ་དང་།
en: Those gods who saw him coming were satisfied, overjoyed, pleased, and glad.

source: འཁོར་ལོ་ཆེན་པོ་དང་། དྲི་ཞིམ་དང་། པད་མ་འདབ་བརྒྱ་དང་། འདབ་སྟོང་དང་། སྐར་འོད་དང་། སྐར་མ་དགའ་དང་། ཀུན་ཏུ་བསྲུང་དང་། བསྲུང་རྟག་དང་། རྟག་ཏུ་མེ་ཏོག་ཆགས་དང་མིག་ཏུ་སྡུག་པ་དེ་དག་དང་།
en: They felt both delight and cheerfulness of mind, and then as an act of worship of the Blessed One, they strewed the Blessed One with heavenly blossoms of blue lotus, white water lily, red lotus, white lotus, māndārava, great māndārava, flowers of the divine Pārijāta tree, red spider lily, great red spider lily, sthāla, great sthāla, rocaka, and great rocaka—flowers the size of great wheels, flowers with intoxicating fragrance, flowers with hundreds and thousands of petals, flowers colored like the red breast of a goose, star flowers that shone with the radiance of a star, flowers whose every part had an everlasting fragrance, and flowers that were ever blooming and pleasing to the eye.

source: མེ་ཏོག་གཞན་དག་གིས་ཀྱང་བཅོམ་ལྡན་འདས་ལ་མངོན་པར་གཏོར་ཏོ། །གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དག་ཀྱང་བསྒྲེང་ངོ་། །རོལ་མོ་སིལ་སྙན་བརྒྱ་སྟོང་ཡང་ལེན་ཏོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བཀོད་པ་རྣམ་པ་དེ་ལྟ་བུ་མེ་ཏོག་གི་ཆར་འབེབས་པ་དང་། སྤོས་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། གོས་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་།
en: These and other flowers were strewn upon the Blessed One while the gods held aloft parasols, flags, and banners, and played hundreds of thousands of musical instruments.

source: བ་དན་གྱི་ཆར་འབེབས་པ་དང་། སིལ་སྙན་དང་། གླུ་དབྱངས་དང་། རོལ་མོའི་སྒྲ་དང་། ལྷའི་བུ་མོ་བརྒྱ་སྟོང་གླུ་ལེན་པ་དག་དང་།
en: With an array such as this one, with showers of flowers raining down, with a heavy downpour of powders, scented oils, garlands, and fragrances, and with cymbals and other musical instruments being played and songs being sung by hundreds of divine maidens, the Blessed One reached the capital city of Aḍagavatī in an instant—in a fraction of an instant.

source: སྐད་ཅིག་ཐང་ཅིག་ཡུད་ཙམ་དེ་ལ་ལྕང་ལོ་ཅན་གྱི་ཕོ་བྲང་འཁོར་དུ་བྱོན་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་དང་། ཉན་ཐོས་ཆེན་པོ་རྣམས་དང་ཐབས་ཅིག་ཏུ་རྒྱལ་པོ་ཆེན་པོ་རྣམ་ཐོས་ཀྱི་བུའི་འདུན་ཁང་དུ་ཞུགས་སོ། །བཅོམ་ལྡན་འདས་ས་ལ་བཞུགས་མ་ཐག་ཏུ་དེ་ནས་དེའི་ཚེ་ས་ཆེན་པོ་དལ་ཞིང་མི་དྲག་ལ་སེམས་ཅན་ཐམས་ཅད་ལ་མི་གནོད་པར་གཡོས་པར་གྱུར་ཏོ། །
en: He alighted at the assembly hall of the Great King Vaiśravaṇa, together with the bodhisattvas and great disciples, and just as soon as the Blessed One was standing firmly on the surface of the earth, at that precise moment in time the great earth shook, gently and slightly, so that no one was harmed by it.

source: དེ་ནས་རྒྱལ་པོ་ཆེན་པོ་བཞིས་བཅོམ་ལྡན་འདས་ལྕང་ལོ་ཅན་གྱི་ཕོ་བྲང་འཁོར་དུ་བྱོན་པར་རིག་ནས་མྱུར་བ་མྱུར་བར་ལ་གོར་དུ་བཙུན་མོའི་འཁོར་དང་བཅས། གཉེན་གྱི་འཁོར་དང་བཅས་ཏེ། མེ་ཏོག་དང་། སྤོས་དང་། ཕྲེང་བ་དང་། བྱུག་པ་ཐོགས་ནས། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་ཕྱིན་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། །
en: When the Four Great Kings knew that the Blessed One had arrived at the capital city of Aḍagavatī, they hastened to his side with the utmost speed, together with the women from their inner chambers, their relatives, and their assemblies, carrying powders, scented oils, garlands, fragrances, incense, and flowers.

source: ཇི་ལྟར་ཐོགས་ཐོགས་པའི་མེ་ཏོག་དང་། སྤོས་དང་། ཕྲེང་བ་དང་། བྱུག་པ་རྣམས་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱས་ཐལ་མོ་སྦྱར་ཏེ། བཅོམ་ལྡན་འདས་ལ་ཕྱག་འཚལ་ཞིང་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །
en: When they arrived, first the Four Great Kings bowed their heads at the feet of the Blessed One, and worshiped him with the scented oils, garlands, incense, and flowers that they had brought, and they stood to one side with their arms outstretched, palms together in a gesture of salutation.

source: བཙུན་མོའི་འཁོར་དང་། དཔུང་གི་ཚོགས་དང་། འཁོར་འདུས་པ་གང་ཡིན་པ་དེ་དག་ཐམས་ཅད་ཀྱིས་ཀྱང་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། ཐལ་མོ་སྦྱར་ནས་འདུད་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་རྒྱལ་པོ་ཆེན་པོ་བཞི་ལས་བརྩམས་ཏེ་འཁོར་དེ་ལྟར་འདུས་པ་དེ་དག་ལ་དེ་ལྟ་བུའི་གཏམ་གྱི་སྦྱོར་བ་མཛད་པས། ཀླུ་དང་། གནོད་སྦྱིན་དང་།
en: Then, the women from the Four Great Kings’ inner chambers, their assembled armies, and everyone else who had gathered there all bowed their heads at the feet of the Blessed One, and stretched out their arms, palms together in a gesture of salutation.

source: དྲི་ཟ་དང་། གྲུལ་བུམ་དང་། སྲིན་པོའི་འཁོར་དེའི་ནང་ནས་སྲོག་ཆགས་ཁྲི་ཉིས་སྟོང་གིས་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ། །རྒྱལ་པོ་ཆེན་པོ་དེ་དག་གི་བཙུན་མོའི་འཁོར་གྱི་ནང་ནས། བུད་མེད་ཁྲིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ། །
en: The Blessed One then gave a talk on the Dharma that was oriented toward those who had gathered there, beginning with the Four Great Kings, which led twelve thousand living creatures among the assemblies of nāgas, yakṣas, rākṣasas, gandharvas, and kumbhāṇḍas gathered there to conceive the aspiration for awakening, and at the same time ten thousand maidens from the Four Great Kings’ inner chambers also conceived the aspiration for unsurpassable and perfect awakening.

source: དེ་ནས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེ་བཙུན་མོའི་འཁོར་དང་བཅས། གཉེན་གྱི་གཡོག་དང་བཅས་ཤིང་འཁོར་དང་། ཡོན་ཏན་མཐའ་ཡས་བཀོད་པའི་གཡོག་འཁོར་དང་བཅས་ཏེ། མེ་ཏོག་དང་། བདུག་པ་དང་། སྤོས་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། གོས་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་ཐམས་ཅད་ཐོགས་ཤིང་། སིལ་སྙན་དང་། ཕེག་རྡོབ་པ་དང་། རོལ་མོའི་སྒྲ་འབྱིན་པ་རྣམས་དང་ལྷན་ཅིག་ཏུ་རྒྱལ་པོ་ཆེན་པོ་རྣམ་ཐོས་ཀྱི་བུའི་འདུན་ཁང་ག་ལ་བ་དང་།
en: At that point, Vajrapāṇi, Lord of the Guhyakas, along with the women from his inner chambers, surrounded by his relatives and their assemblies, and with the entire population of Anantaguṇaratnavyūha in his train, came to the assembly hall of the Great King Vaiśravaṇa, bearing all manner of flowers, fragrances, garlands, scented oils, incense, powders, linens, parasols, flags, and banners, and making music by singing and playing cymbals and other musical instruments.

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། ལན་བདུན་བསྐོར་བ་བྱས་ནས་ཇི་ལྟར་ཐོགས་ཐོགས་པའི་མེ་ཏོག་དང་། བདུག་པ་དང་། སྤོས་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། གོས་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་རྣམས་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱས་ཏེ།
en: He approached the Blessed One, bowed his head at the Blessed One’s feet, walked around him seven times, keeping him on the right, and worshiped the Blessed One with the flowers, incense, fragrances, garlands, scented oils, powders, linens, parasols, flags, and banners of various kinds that had been brought, and with music being made by singing and playing musical instruments.

source: སིལ་སྙན་དང་། རོལ་མོ་བྱས་ནས། བཅོམ་ལྡན་འདས་ལ་ཕྱག་འཚལ་ཏེ། དགེ་སློང་གི་དགེ་འདུན་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་དང་བཅས་པར་ལྷན་ཅིག་ཏུ་རང་གི་འཁོར་གྱི་ཁྱམས་སུ་སྤྱན་དྲངས་སོ། །
en: Then he paid homage to the Blessed One and brought him into his courtyard, along with the monastic community.

source: དེ་ནས་བཅོམ་ལྡན་འདས་འཁོར་གྱི་ཁྱམས་དེར་ས་ལ་མི་རྟེན་པ་རྣམ་པ་ཐམས་ཅད་ཀྱི་མཆོག་དང་ལྡན་པ་ཉིད་ཀྱི་སེང་གེའི་གདན་ཇི་ལྟར་བཤམས་པ་ལ་བཞུགས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་དང་ཉན་ཐོས་ཆེན་པོ་དེ་དག་དང་། ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་ཡང་སྟན་ཅི་རིགས་བ་དག་ལ་འཁོད་དོ། །
en: The Blessed One then sat down upon his own lion’s seat that had been prepared for him in the courtyard, which was hovering above the ground’s surface and was endowed with the finest of all qualities, while the bodhisattvas and the great disciples took their own seats, and so did the whole assembly.

source: དེ་ནས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེས་བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་དེ་དག་དང་། ལྷའི་འཁོར་ཆེན་པོ་དེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཁྱེད་དེ་བཞིན་གཤེགས་པ་ལ་བསུ་བགྱིས་ཤིག །
en: Vajrapāṇi, Lord of the Guhyakas, then said this to the assembly of gods: “Come and assist the worship of the Realized One.

source: མཆོད་པ་དང་།
en: For, as the Realized One has said,

source: རིམ་གྲོ་གྱིས་ཤིག །དེ་ནི་དེ་བཞིན་གཤེགས་པས་ཀྱང་། །དེ་ལ་གང་དག་ཡི་རང་དང་། །
en: “ ‘Those who give their approval in such a case,

source: ཞལ་ཏ་བྱ་བ་བྱེད་པ་ནི། །
en: And do the business with which they have been tasked,

source: དེ་དག་བསོད་ནམས་སྐལ་བ་ཅན། །
en: Their reward will not be the lesser for it.

source: དེ་དག་ཡོན་ནི་ཆུང་བ་མིན། །
en: They, too, will receive their share of merit.’

source: ཞེས་བཀའ་སྩལ་གྱིས། དེ་ལ་གྲོགས་པོ་དག་ཁྱེད་ཀྱིས་རྗེས་སུ་ཡི་རང་བ་དང་ལྡན་པ་དང་། ཞལ་ཏ་བྱ་བ་དང་ལྡན་པའི་བསོད་ནམས་བྱ་བའི་དངོས་པོ་ལོང་ཤིག །
en: “Therefore, friends, may you provide the accompanying approval and receive the merit that is the effect of such activity.”

source: དེ་ནས་ལྷའི་བུ་དེ་དག་གིས་འཁོར་གྱི་ཁྱམས་བཀོད་པ་དེ་དང་། སེང་གེའི་ཁྲི་བཀོད་པ་ཡང་མཐོང་ངོ་། །དེ་མཐོང་ནས་ངོ་མཚར་དུ་གྱུར་ཏེ།
en: Indeed, when the gods beheld the array in the courtyard and the array of lion’s seats, they were astounded, and thus inspired they uttered this inspired utterance: “Whose majestic power is this?

source: འདི་ནི་དེ་བཞིན་གཤེགས་པའི་མཐུའམ། འོན་ཏེ་གསང་བ་པའི་བདག་པོའི་འམ། སུའི་ཡིན་ཞེས་ཆེད་དུ་བརྗོད་པ། ཆེད་དུ་བརྗོད་པ་དང་།
en: Is it the Realized One’s, or is it that of the Lord of the Guhyakas?”

source: དེ་དག་གིས་བར་སྣང་ལས་འདི་ནི་གསང་བ་པའི་བདག་པོའི་བྱིན་གྱི་རླབས་ཡིན་ཏེ།
en: Then, a voice was heard from the sky, which said, “It is the empowering authority of the Lord of the Guhyakas.

source: གྲོགས་པོ་དག་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་ཤར་ཕྱོགས་ལོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་འདས་པ་ན་འཇིག་རྟེན་གྱི་ཁམས་ཡོན་ཏན་རིན་པོ་ཆེ་མཐའ་ཡས་པ་བཀོད་པ་ཞེས་བྱ་བ་དེ་ན་དེ་བཞིན་གཤེགས་པ་བཀོད་པ་ཆེན་པོའི་རྒྱལ་པོ་ཞེས་བྱ་བ་ཆོས་སྟོན་པ་དེར་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེས་བཀོད་པ་རྣམ་པ་འདི་ལྟ་བུ་མཐོང་ནས་གསང་བ་པའི་བདག་པོས་བཀོད་པ་དེ་ཉིད་འཁོར་གྱི་ཁྱམས་འདིར་བྱིན་གྱིས་བརླབས་སོ་ཞེས་སྒྲ་ཐོས་སོ། །
en: In the eastern direction from here, friends, beyond buddha domains equal to the number of grains of sand in the Ganges River, there is a world called Anantaguṇaratnavyūha, where the realized one Vyūharāja teaches the Dharma. With the Lord of the Guhyaka’s empowering authority, he has transformed the courtyard here into an array with an appearance similar to the array that the Lord of the Guhyakas saw there.”

source: བཅོམ་ལྡན་འདས་སེང་གེའི་གདན་དེ་ལ་བཞུགས་མ་ཐག་ཏུ་དེ་ནས་དེའི་ཚེ་ལྕང་ལོ་ཅན་གྱི་ཕོ་བྲང་འཁོར་ན་གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། ཡི་དགས་དང་། ཤ་ཟ་དང་། དྲི་ཟ་དང་།
en: As soon as the Blessed One sat upon the lion seat, at that very moment, the yakṣas, rākṣasas, pretas, piśācas, gandharvas, guhyakas, and mahoragas that were dwelling in the capital city of Aḍagavatī drew near to the Blessed One.

source: གསང་བ་པ་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་ཇི་སྙེད་འཁོད་པ་དེ་དག་ཐམས་ཅད་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་ཕྱིན་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་ཕྱོགས་གཅིག་ཏུ་འཁོད་ནས། ཐལ་མོ་སྦྱར་ཏེ་བཅོམ་ལྡན་འདས་ལ་འདུད་དོ། །
en: Once they had drawn near, they bowed their heads at the feet of the Blessed One, and then stood to the side, while raising their arms, palms together, in a gesture of salutation to the Blessed One.

source: དེ་ནས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེས་རྒྱལ་པོ་ཆེན་པོ་བཞི་དང་། ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་ལ་སྨྲས་པ། ཁྱེད་ཐམས་ཅད་ལྷན་ཅིག་ཏུ་འདུས་ལ་ལྷན་ཅིག་ཏུ་ཚུར་ཤེག །ཇི་ལྟར་བཤམས་པའི་ཞལ་ཟས་བཅོམ་ལྡན་འདས་ལ་གསོལ་ཅིག །དེ་ནས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེ་བཙུན་མོའི་འཁོར་དང་བཅས། གཉེན་གྱི་འཁོར་དང་བཅས། བུ་དང་བཅས། དཔུང་དང་བཅས།
en: Now, Vajrapāṇi, Lord of the Guhyakas, invited the Four Great Kings and the whole assembly, saying, “Come, all of you who have gathered here, join together while we present the Blessed One with the meal that has been set out accordingly.”

source: གཡོག་འཁོར་དང་བཅས་ཏེ། རང་གི་ལག་ནས་གུས་པར་བསྟི་སྟང་དུ་བྱས་ཏེ། བཟའ་བ་དང་། བཅའ་བ་བསོད་པ་མང་པོ་རོ་བྲོ་བ་མང་པོ་དུ་མ་དང་ལྡན་པ་བྱང་ཆུབ་སེམས་དཔའི་ལྷག་པའི་བསམ་པས་ཡོངས་སུ་དག་པ། དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པར་འོས་པའི་ཞལ་ཟས་ཀྱིས་དེ་བཞིན་གཤེགས་པ་བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་དང་དགེ་སློང་གི་དགེ་འདུན་དང་བཅས་པ་ལ་བསྟབས་ཏེ་ཚིམ་པར་བྱས་སོ། །
en: Then, along with the women from his inner chambers, his relatives, his sons, his soldiers, and his attendants, Vajrapāṇi, Lord of the Guhyakas, with his own hands and with the deepest respect, served the Realized One, the bodhisattvas, and the community of monks with an abundant and excellent meal of hard and soft foods, arrayed with many different flavors, a meal that was made pure by the motivation of a bodhisattva and worthy of being offered in worship to the Realized One, which satiated and entertained them.

source: བསྟབས་ཏེ་ཚིམ་པར་བྱས་ནས་ལྷུང་བཟེད་གྱུ་སྟེ། བཅོམ་ལྡན་འདས་ཕྱག་བཅབས་པར་རིག་ནས་ཆོས་མཉན་པའི་ཕྱིར་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འདུག་གོ། །
en: After he had entertained and satiated the Blessed One, and he knew that the Blessed One had washed his hands and put away his alms bowl, he sat down in front of the Blessed One to listen to the Dharma.

source: ལྕང་ལོ་ཅན་གྱི་ཕོ་བྲང་འཁོར་ན་འཁོད་པའི་གནོད་སྦྱིན་དང་། སྲིན་པོ་གང་ཡིན་པ་དེ་དག་ཀྱང་འདུས་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞལ་དུ་བལྟས་ཏེ། ཐལ་མོ་སྦྱར་ནས་ཕྱག་འཚལ་ཏེ་འཁོད་པར་གྱུར་ཏོ། །
en: When all the yakṣas and rākṣasas who were living in the capital city of Aḍagavatī had gathered there, too, they stood looking up at the face of the Blessed One with their arms outstretched, palms together in a gesture of salutation.

source: ལྕང་ལོ་ཅན་དུ་གཤེགས་ནས་བཤོས་གསོལ་བའི་ལེའུ་ཞེས་བྱ་བ་སྟེ་བཅྭ་བརྒྱད་པའོ།། །།དེ་ནས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེས་ཆོས་མཉན་པའི་ཕྱིར་བཅོམ་ལྡན་འདས་ལ་གསོལ་བ་བཏབ་པ། ཅི་ནས་བྱང་ཆུབ་ཏུ་སེམས་མ་བསྐྱེད་པའི་སེམས་ཅན་རྣམས་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པར་འགྱུར་བ་དང་། ཕྱིར་མི་ལྡོག་པ་ལ་གནས་པར་འགྱུར་བ་དང་།
en: This was the eighteenth chapter, “Enjoying a Meal After Going to Aḍagavatī.”

source: གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། ཤ་ཟ་དང་། དྲི་ཟ་དང་། གསང་བ་པ་དང་། ལྟོ་འཕྱེ་ཆེན་པོའི་འཁོར་འདིའི་ཡུན་རིང་པོའི་དོན་དང་། སྨན་པ་དང་། བདེ་བ་དང་། གྲུབ་པ་དང་། བདེ་བར་འགྱུར་བ་དང་། ཁྱད་པར་གྱིས་ཁྱད་པར་དུ་མངོན་པར་འཕགས་པར་འགྱུར་བ་དང་།
en: Chapter 19: The Protectors of the World

source: ཉམས་པའི་ཆ་ཅན་དུ་མི་འགྱུར་བར་དེ་ལྟར་ཆོས་ཀྱི་ཚུལ་ལ་འཇུག་པ་བཅོམ་ལྡན་འདས་ཀྱིས་བཤད་དུ་གསོལ།
en: Vajrapāṇi, Lord of the Guhyakas, then asked the Blessed One to teach the Dharma: “Please give a teaching that will introduce the guiding principles of the Dharma in such a way that those beings who have not yet conceived the aspiration for awakening will conceive the aspiration for awakening, and become firmly established in the state of being unable to be turned back from unsurpassable and perfect awakening, and so that it will be to the benefit, prosperity, bliss, and aims of this assembly of yakṣas, rākṣasas, pretas, piśācas, gandharvas, guhyakas, and mahoragas for a long time, and so that by this distinction they will rise to a state of distinction and will not give up any part of it.”

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེ་དང་། ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་ལ་བཀའ་སྩལ་པ། གྲོགས་པོ་དག་དེའི་ཕྱིར་ལེགས་པར་རབ་ཏུ་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་བཤད་པར་བྱ་སྟེ། རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོ་དག་གང་ལ་ཞུགས་ན་ཁྱད་པར་མངོན་དུ་འཕགས་པར་འགྱུར་ཞིང་ཉམས་པའི་ཆ་ཅན་དུ་ཡང་མི་འགྱུར་བའི་ཆོས་ཀྱི་ཚུལ་ཁྱེད་ལ་བསྟན་པར་བྱའོ། །
en: After this had been said, the Blessed One addressed Vajrapāṇi, Lord of the Guhyakas, and the entire assembly, saying, “Listen well, friends, and pay careful and close attention, for I will give a teaching that will introduce the way of the Dharma in such a way that a noble son or noble daughter who sets foot upon it will suitably rise to a level of distinction, and will not give up any part of it.

source: བཅོམ་ལྡན་འདས་ལེགས་སོ་ཞེས་གསོལ་ཏེ། གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེ་དང་། ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེས་བཅོམ་ལྡན་འདས་ཀྱི་ལྟར་མཉན་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་དེ་དག་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: Vajrapāṇi, Lord of the Guhyakas, said, “Good, Blessed One!” And he and the whole assembly listened to the Blessed One, as the Blessed One said this to them:

source: གྲོགས་པོ་དག་འདི་ལ་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་བསམ་པ་ཐག་པ་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དེ། དད་པ་ཡིན།
en: “In this regard, friends, noble sons and noble daughters with ambition who have conceived the aspiration for unsurpassable and perfect awakening are believers.

source: དང་བ་མང་ཞིང་འཕགས་པ་རྣམས་ལ་ལྟ་འདོད་པ་དང་།
en: They have an abundance of faith.

source: དམ་པའི་ཆོས་ཉན་པར་འདོད་པ་དང་།
en: They have a desire to be in sight of the noble ones and they desire to hear the Dharma.

source: སེར་སྣ་མེད་པར་གཏང་བ་གཏོང་བ་དང་།
en: Without greed, they freely surrender everything.

source: ལག་བརྐྱང་སྟེ་གཏོང་བ་ལ་དགའ་བ་དང་། མཆོད་སྦྱིན་བྱེད་པའི་ངང་ཅན་དང་།
en: Their hands are open, and they delight in making gifts.

source: གཏོང་བ་ཕུན་སུམ་ཚོགས་པ་དང་།
en: They have an urge to sponsor sacrifices.

source: སྦྱིན་པ་འགེད་པ་ལ་དགའ་བ་དང་།
en: They have a connection with surrender and they delight in sharing with others through their generosity.

source: ཁོང་ཁྲོ་མེད་པའི་སེམས་དང་ལྡན་པ་དང་། རྙོག་པ་མེད་པའི་སེམས་དང་ལྡན་པ་དང་།
en: “Their thoughts are free of hostility and they possess clarity of mind.

source: དེ་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ལ་ཡིད་ཆེས་པ་དང་།
en: They believe in the idea that actions produce consequences.

source: མོས་པ་དང་།
en: They take an active interest in it;

source: རྟོགས་པ་དང་།
en: they put their confidence in it.

source: སོམ་ཉི་མེད་ལ་ཐེ་ཙོམ་མི་ཟ་ཞིང་ཡིད་གཉིས་མི་ཟ་བ་ཡིན། དེ་དཀར་པོ་དང་།
en: They are free of uncertainty, they have no doubts, and they do not take the opposing viewpoint.

source: ནག་པོའི་ལམ་རྣམས་ཀྱི་རྣམ་པར་སྨིན་པ་ཆུད་མི་ཟ་བར་རིག་ནས། སྲོག་གི་ཕྱིར་ཡང་མི་བྱ་བ་མི་བྱེད་དེ།
en: They know that the fruits of good and bad actions do not perish, and so they do not do what should not be done, even for the sake of their lives.

source: དེ་སྲོག་གཅོད་པ་སྤངས་པ་ཡིན།
en: “They abstain from harming beings.

source: མ་བྱིན་པར་ལེན་པ་དང་།
en: They abstain from taking what is not given;

source: འདོད་པ་ལ་ལོག་པར་གཡེམ་པ་དང་།
en: they abstain from sexual misconduct;

source: བརྫུན་དུ་སྨྲ་བ་དང་། ཕྲ་མ་དང་། ངག་རྩུབ་པོ་དང་། ཚིག་ཀྱལ་པ་དང་།
en: they abstain from lying, from slanderous speech, from harsh speech, and from idle chatter;

source: བརྣབ་སེམས་དང་། གནོད་སེམས་དང་། ལོག་པར་ལྟ་བ་སྤངས་པ་ཡིན་ཏེ།
en: and they abstain from covetousness, from malice, and from wrong views.

source: མི་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལ་མི་དམིགས་པ་ཡིན་ནོ། །
en: They undertake the path of the ten forms of good conduct, and they do not take the path of the ten forms of bad conduct.

source: དེ་དད་པར་གྱུར་ནས། དགེ་སྦྱོང་ངམ་བྲམ་ཟེ་གང་དག་ཡང་དག་པར་སོང་བ་དང་།
en: “Full of belief and ready to be guided, such a noble son or daughter recognizes ascetics and brahmins whose conduct is right;

source: ཡང་དག་པར་ཞུགས་པ་དང་། ཚུལ་ཁྲིམས་དང་ལྡན་པ་དང་།
en: who have practiced what is right;

source: ཡོན་ཏན་དང་ལྡན་པ་དང་།
en: who are in full possession of moral conduct, virtue, and wisdom;

source: ངེས་པ་དང་།
en: who are experts;

source: དགེ་བའི་ཆོས་ཅན་དང་།
en: who have the quality of goodness;

source: མང་དུ་ཐོས་པ་དང་།
en: who are greatly learned;

source: ཐོས་པ་ལ་མངོན་པར་བརྩོན་པ་དང་།
en: who have applied themselves to knowledge;

source: ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་པ་ལ་རབ་ཏུ་བརྩོན་པ་དང་།
en: who have repeatedly applied careful attention;

source: ཞི་བ་དང་། དུལ་བ་དང་། ཉེ་བར་ཞི་བ་དང་།
en: who are calm, controlled, and at peace;

source: དོ་ཟློག་ཕོད་པར་སྨྲ་ཞིང་གཅམ་བུར་མི་སྨྲ་བ་དང་། དགེ་བའི་བསམ་པ་ཅན་དང་།
en: who speak with restraint, assume an inoffensive manner, and have good intentions;

source: མི་དགེ་བའི་ཆོས་ཡོངས་སུ་སྤོང་བ་དང་།
en: who expel bad qualities;

source: མི་རྒོད་པ་དང་། མ་ཁེངས་པ་དང་།
en: who are not haughty or condescending;

source: མུ་ཅོར་སྨྲ་བ་མ་ཡིན་པ་དང་།
en: who are not boisterous;

source: ཚིག་མ་འཆལ་པ་དང་།
en: who are not loose with their words;

source: དྲན་པ་ཉེ་བར་གནས་པ་དང་།
en: who attend to mindfulness;

source: ཤིན་ཏུ་མཉམ་པར་བཞག་པའི་སེམས་དང་ལྡན་པ་དང་།
en: whose minds are concentrated in meditation;

source: སྲིད་པའི་ཚུལ་བཅད་པ་དང་།
en: who have cut off the conduit to continued existence;

source: ཟུག་རྔུ་ཕྱུང་བ་དང་།
en: who have drawn out the thorn;

source: ཁུར་བོར་བ་དང་།
en: who have put down their burden;

source: སོམ་ཉི་ལས་ངེས་པར་རྒལ་བ་དང་།
en: who have left behind uncertainty;

source: ཐེ་ཙོམ་ལས་རྒལ་བ་དང་། ཡང་སྲིད་པ་ལས་རྒལ་བ། འདི་ལྟ་སྟེ།
en: who have left behind doubt;

source: དེ་བཞིན་གཤེགས་པ་དང་། དེ་བཞིན་གཤེགས་པའི་ཉན་ཐོས་དགེ་སྦྱོང་དང་། བྲམ་ཟེ་རྣམ་པ་དེ་ལྟ་བུ་ལ་དགེ་བའི་བཤེས་གཉེན་དུ་རིག་ནས་སྟེན་ཏོ། །བསྙེན་ཏོ། །བསྙེན་བཀུར་བྱེད་དོ། །
en: and who have left behind future rebirth—such a noble son or daughter knows them to be companions in what is good who appear in the form of ascetics and brahmins, but are actually buddhas and disciples of buddhas, and serves them, supports them, stays close to them, pleases them, does not displease them, and gains their favor.

source: མཉེས་པར་བྱེད་ཅིང་མི་མཉེས་པར་མི་བྱེད་ལ་དགྱེས་པར་བྱེད་དེ། དེས་དགེ་བའི་བཤེས་གཉེན་དེ་དག་མཉེས་པར་བྱས་པས་ཆོས་ཀྱི་གཏམ་གྱིས་ཡང་དག་པར་སྟོན་ཡང་དག་པར་འཛིན་དུ་འཇུག །
en: “Companions in what is good whose favor is gained in this way make it clear, by means of talking about the nature of things, that generosity brings a state of great enjoyment.

source: ཡང་དག་པར་གཟེངས་སྟོད།
en: They demonstrate it; they enable noble sons and daughters to grasp it;

source: ཡང་དག་པར་དགའ་བར་མཛད་དེ།
en: they make them excited about it;

source: སྦྱིན་པས་ནི་ལོངས་སྤྱོད་ཆེན་པོར་འགྱུར་བར་ཡང་དག་པར་སྟོན།
en: they make them pleased about it.

source: ཚུལ་ཁྲིམས་ཀྱིས་ནི་མཐོ་རིས་སུ་སྐྱེ་བ་དང་། ཐོས་པས་ནི་ཤེས་རབ་ཆེན་པོར་འགྱུར་བ་དང་།
en: Similarly, they also make it clear that moral conduct brings rebirth in the heavens, that learning brings about a state of great wisdom, and that meditative cultivation brings freedom.

source: བསྒོམས་པས་ནི་འབྲལ་བར་འགྱུར་བར་ཡང་དག་པར་སྟོན་ཏོ། །
en: They do so by saying:

source: འདི་ནི་སྦྱིན་པའོ། །
en: “ ‘This is giving;

source: འདི་ནི་སྦྱིན་པའི་རྣམ་པར་སྨིན་པའོ། །
en: this is the result of giving.

source: འདི་ནི་སེར་སྣའོ། །
en: This is stinginess;

source: འདི་ནི་སེར་སྣའི་རྣམ་པར་སྨིན་པའོ། །
en: this is the result of stinginess.

source: འདི་ནི་ཚུལ་ཁྲིམས་སོ། །
en: This is moral conduct;

source: འདི་ནི་ཚུལ་ཁྲིམས་ཀྱི་རྣམ་པར་སྨིན་པའོ། །
en: this is the result of moral conduct. This is immoral conduct; this is the result of immoral conduct.

source: འདི་ནི་བཟོད་པའོ། །
en: This is patience;

source: འདི་ནི་བཟོད་པའི་རྣམ་པར་སྨིན་པའོ། །
en: this is the result of patience.

source: འདི་ནི་བརྩོན་འགྲུས་སོ། །
en: This is heroic effort;

source: འདི་ནི་བརྩོན་འགྲུས་ཀྱི་རྣམ་པར་སྨིན་པའོ། །
en: this is the result of heroic effort.

source: འདི་ནི་བསམ་གཏན་ནོ། །
en: This is meditation;

source: འདི་ནི་བསམ་གཏན་གྱི་རྣམ་པར་སྨིན་པའོ། །
en: this is the result of meditation.
